# pandas的基礎操作
- 現在可以更深入於資料的分析和操作資料

## 使用reindex()重新建立索引

In [63]:
import pandas as pd
import numpy as np

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [64]:
#使用reindex()方法,重新規劃新索引
#沒有索引到的資料會被移除
#新增的索引會使用 NaN

obj2 = obj.reindex(['a', 'c', 'd', 'e'])
obj2

a   -5.3
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
#DataFrame使用reindex()
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                    index=['a', 'c', 'd'],
                    columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [66]:
#使用reindex()新增row
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
print(frame2)
print('----------')

#使用reindex()移除row
frame2 = frame.reindex(['a', 'c'])
print(frame2)
print('------------')

#使用reindex()的columns引數名稱,新增移除column
states = ['台北', '高雄', '台南']
frame2 = frame.reindex(['a', 'c'],columns=states)
frame2

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0
----------
   台北  台中  高雄
a   0   1   2
c   3   4   5
------------

    台北   高雄  台南
a  0.0  2.0 NaN
c  3.0  5.0 NaN

## 使用drop()移除欄或列
- 只有移除,不重新排列順序

In [87]:
#Series
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
print(obj)
print(1,'---------------')

#使用drop()方法移除一個索引
new_obj = obj.drop('c')
print(new_obj)
print(2,'---------------')

#使用drop()方法移除多個索引
new_obj = obj.drop(['d', 'c'])
new_obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
1 ---------------
a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64
2 ---------------

a    0.0
b    1.0
e    4.0
dtype: float64

In [68]:
#DataFrame
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
print(data)
print(1,'-------------------')

#drop()預設是移除row
drapData = data.drop(['台北','台中'])
print(drapData)
print(2,'-------------------')


#使用引數名稱axis=1或axis='columns'移除欄
drapData = data.drop('two', axis=1)
print(drapData)
print(3,'-------------------')
drapData = data.drop(['two', 'four'], axis='columns')
drapData

#如果是要移除原始資料,必需使用引數名稱inplace=True
data.drop('台北', inplace=True)
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15
-------------------
    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15
-------------------
    one  three  four
台北    0      2     3
台中    4      6     7
台南    8     10    11
高雄   12     14    15
-------------------

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

## 索引、選取、過濾

In [88]:
#Series的索引(obj[...])類似於ndarray,除了series的索引沒有限定整數,還可以是字串
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj)
print(1,'------------')

print(obj['b'])
print(2,'------------')

#使用索引
print(obj[1])
print(3,'---------')

#使用slice()
print(obj[2:4])
print(4,'---------')

#使用list,slice
print(obj[['b', 'a', 'd']])
print(5,'---------')

#使用list,索引
print(obj[[1, 3]])
print(6,'---------')

#使用boolean series
print(obj[obj < 2])
print(7,'--------------')

#使用標籤的slice,不同於整數的slice,最後一個是包含的
print(obj['b':'c'])
print(8,'--------------')

#也可使用選取時,給值
obj['b': 'c'] = 5
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64
1 ------------
1.0
2 ------------
1.0
3 ---------
c    2.0
d    3.0
dtype: float64
4 ---------
b    1.0
a    0.0
d    3.0
dtype: float64
5 ---------
b    1.0
d    3.0
dtype: float64
6 ---------
a    0.0
b    1.0
dtype: float64
7 --------------
b    1.0
c    2.0
dtype: float64
8 --------------

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [98]:
#DataFrame的索引,主要是取出1個或多個欄位.一個欄位是取出Series
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
print(data)
print(1,'------------')

#取出一欄,是Series
print(data['two'])
print(2,'------------')

#使用list取出多欄
print(data[['three', 'one']])
print(3,'--------------')

#使用數值的索引是取出row
print(data[:2])
print(4,'--------------')

#使用boolean series做為選取
print(data[data['three'] > 5])
print(5,'--------------')

#使用boolean dataFrame做為選取
print(data < 5)
print(6,'--------------')

data[data<5] = 0
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15
1 ------------
台北     1
台中     5
台南     9
高雄    13
Name: two, dtype: int64
2 ------------
    three  one
台北      2    0
台中      6    4
台南     10    8
高雄     14   12
3 --------------
    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
4 --------------
    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15
5 --------------
      one    two  three   four
台北   True   True   True   True
台中   True  False  False  False
台南  False  False  False  False
高雄  False  False  False  False
6 --------------

    one  two  three  four
台北    0    0      0     0
台中    0    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

### 使用loc,iloc選取
- loc()使用標籤索引
- iloc()使用整數索引

In [109]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
print(data)
print(1,'-----------------------------')
#使用loc
print(data.loc['台北',['two', 'three']])
print(2,'-----------------------------')

#使用iloc
data.iloc[2,[3, 0, 1]]

#使用iloc取出整列
print(data.iloc[2])
print(3,'----------------------------')

#使用iloc
print(data.iloc[[1, 2],[3, 0, 1]])
print(4,'----------------------------')

#使用loc配合標籤slice語法
print(data.loc[:'台南','two'])
print(5,'----------------------------')

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15
1 -----------------------------
two      1
three    2
Name: 台北, dtype: int64
2 -----------------------------
one       8
two       9
three    10
four     11
Name: 台南, dtype: int64
3 ----------------------------
    four  one  two
台中     7    4    5
台南    11    8    9
4 ----------------------------

台北    1
台中    5
台南    9
Name: two, dtype: int64

## 數學運算和資料對齊

In [112]:
import pandas as pd
import numpy as np

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

print(s1)
print(1,'--------------------')

print(s2)
print(2,'--------------------')

#運算時使用標籤對齊
print(s1 + s2)
print(3,'--------------------')

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
1 --------------------
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64
2 --------------------
a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64
3 --------------------

In [120]:
#dataFrame運算時同時對齊row和columns標籤
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                  columns=list('bcd'),
                  index=['台北','台中','台南'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                  columns = list('bde'),
                  index=['高雄','台北','台中','台南'])
print(df1)
print(1,'---------------------')

print(df2)
print(2,'----------------------')

#同時row,column標籤對齊
print(df1 + df2)
print(3,'----------------------')


#都沒有row,column標籤對齊
df1 = pd.DataFrame({'A':[1, 2]})
df2 = pd.DataFrame({'B':[3, 4]})

print(df1)
print(4,'----------------------')

print(df2)
print(5,'----------------------')

df1-df2

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0
1 ---------------------
      b     d     e
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0
2 ----------------------
       b   c     d   e
台中   9.0 NaN  12.0 NaN
台北   3.0 NaN   6.0 NaN
台南  15.0 NaN  18.0 NaN
高雄   NaN NaN   NaN NaN
3 ----------------------
   A
0  1
1  2
4 ----------------------
   B
0  3
1  4
5 ----------------------

    A   B
0 NaN NaN
1 NaN NaN

In [125]:
#add()方法配合fill_value引數名稱
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
print(df1)
print('a','-------------------')
print(df2)
print('b','-------------------')

#使用fill_value
df1.add(df2, fill_value=0)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
a -------------------
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0
b -------------------

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

|方法|表示|
|:--|:--|
|add|+|
|sub|-|
|div|/|
|floordiv|//|
|mul|*|
|pow|**|

## Function 和 Mapping
- numpy 的ufunc也可以使用在pandas上

In [127]:
import pandas as pd
import numpy as np

frame = pd.DataFrame(np.random.randn(4,3),
                    columns=list('bde'),
                    index=['台北','台中','台南','高雄'])
frame

           b         d         e
台北 -1.384638 -0.412816  0.614363
台中 -0.643563  1.413325  2.229433
台南  1.735249 -0.540851 -0.499227
高雄  0.811424 -0.910415 -0.124838

In [128]:
#numpy絕對值
np.abs(frame)

           b         d         e
台北  1.384638  0.412816  0.614363
台中  0.643563  1.413325  2.229433
台南  1.735249  0.540851  0.499227
高雄  0.811424  0.910415  0.124838

In [129]:
#使用apply(function)
#預設為列,非列的索引,使用整列的方向
#function必需return 值
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.119887
d    2.323740
e    2.728660
dtype: float64

In [130]:
#使用apply(,axis='columns'),使用整欄的方法
f = lambda x: x.max() - x.min()
frame.apply(f, axis='columns')

台北    1.999001
台中    2.872996
台南    2.276100
高雄    1.721839
dtype: float64

In [134]:
#使用apply(function)
#function return值不一定是純值,也可以是Series
frame = pd.DataFrame(np.random.randn(4,3),
                    columns=list('bde'),
                    index=['台北','台中','台南','高雄'])
frame

           b         d         e
台北 -0.812315 -0.507539 -0.044107
台中  0.017816 -1.758226 -0.846614
台南  0.310608 -0.226755  0.461839
高雄  0.247513 -0.908478 -1.029405

In [135]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

frame.apply(f)

            b         d         e
min -0.812315 -1.758226 -1.029405
max  0.310608 -0.226755  0.461839

In [137]:
#dataFrame應用到每一value,使用applymap(function)
format = lambda x: '%.2f' % x
frame.applymap(format)

        b      d      e
台北  -0.81  -0.51  -0.04
台中   0.02  -1.76  -0.85
台南   0.31  -0.23   0.46
高雄   0.25  -0.91  -1.03

In [138]:
#Series應用每一個value,做用map
frame['e'].map(format)

台北    -0.04
台中    -0.85
台南     0.46
高雄    -1.03
Name: e, dtype: object

## 排序和排名